//+---------------------------------------------------------------------------+
/* УСЛОВИЕ ЗАДАЧИ:
 * Создать класс "круг". В созданном класс реализовать методы:
 * - расчет площади круга;
 * - расчет длины окружности;
 * Созданные методы применить на каком либо примере
 */
//+---------------------------------------------------------------------------+



using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;



//ОБЪЯВЛЕНИЕ ПРОСТРАНСТВА ИМЕН
//+---------------------------------------------------------------------------+
namespace PracticalExercise_1
{


    //ТОЧКА ВХОДА В ПРОГРАММУ
    //+-----------------------------------------------------------------------+
    class Program
    {
        static void Main(string[] args)
        {
            //ОБЪЯВЛЕНИЕ ПЕРЕМЕННЫХ
            //+---------------------------------------------------------------+
            //::создание инициализация объекта класса "круг"
            Circle circle = new Circle(10);



            //РЕШЕНИЕ ЗАДАЧИ
            //+---------------------------------------------------------------+

            //::расчет площади круга и вывод полученного значения на экран
            Console.WriteLine("{0,-15} - {1:F2}", "Circle square", 
                circle.Square());

            //::расчет длины окружности и вывод полученного значения на экран
            Console.WriteLine("{0,-15} - {1:F2}", "Circle circumference", 
                circle.Circumference());
        }
    }
}
